vermilion00/PSoC-Course/Exercise4/LucaSpenglerPSoC5Serial.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_DelSig_1.h"
#include "Vin_aliases.h"
#include "Vin.h"
#include "UART_1.h"
#include "Button_aliases.h"
#include "Button.h"
#include "rx_isr.h"
#include "ledOut_aliases.h"
#include "ledOut.h"
#include "I2C_1.h"
#include "I2C_1_PVT.h"
#include "sda_pin_aliases.h"
#include "sda_pin.h"
#include "scl_pin_aliases.h"
#include "scl_pin.h"
#include "SPIM_1.h"
#include "SPIM_1_PVT.h"
#include "miso_pin_aliases.h"
#include "miso_pin.h"
#include "sclk_pin_aliases.h"
#include "sclk_pin.h"
#include "cs_pin_aliases.h"
#include "cs_pin.h"
#include "ADC_DelSig_1_AMux.h"
#include "ADC_DelSig_1_Ext_CP_Clk.h"
#include "ADC_DelSig_1_IRQ.h"
#include "ADC_DelSig_1_theACLK.h"
#include "UART_1_IntClock.h"
#include "I2C_1_IntClock.h"
#include "SPIM_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

